blog/app/views/post/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
---
<h1>Commentaires</h1>
<% @post.comments.each do |comment| %>