blog/app/controllers/comments_controller.rb

  def show
    post = Post.find(params[:id])
    @comment = post.comments.find(params[:comment_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "37"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 10 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    post = Post.find(params[:id])
    @comment = post.comments.find(params[:comment_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    post = Post.find(params[:id])
    @comment = post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("author", "body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", ""], ["body", ""], ["created_at", Sun, 27 Nov 2011 10:55:53 UTC +00:00], ["post_id", 1], ["updated_at", Sun, 27 Nov 2011 10:55:53 UTC +00:00]]

  def update
    post = Post.find(params[:id])
    @comment = post.comments.find(params[:comment_id])
		@comment.author = params[:author]
		@comment.body = params[:body]
		@comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "comments" SET "author" = 'Auteur modifie', "body" = 'Contenu modifie', "updated_at" = '2011-11-27 13:45:50.200826' WHERE "comments"."id" = 1

  def delete
    post = Post.find(params[:id])
    @comment = post.comments.find(params[:comment_id])
    @comment.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]