blog/app/controllers/post_controller.rb

	def index
		#if session[:person_id].nil?
			@posts = Post.all
---
SELECT "posts".* FROM "posts"

	def show
		#@post = Post.find(params[:id])
    @post = Post.find(params[:id], :include => [{:comments => :person }])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]

	def create
		@post = Post.new
		@post.title = params[:title]
		@post.body = params[:body]
		@post.person_id = session[:id]
		@post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", ""], ["created_at", Sun, 13 Nov 2011 14:25:51 UTC +00:00], ["title", ""], ["updated_at", Sun, 13 Nov 2011 14:25:51 UTC +00:00]]

	def receive
		@post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]

	def modify
		@post = Post.find(params[:id])
		@post.title = params[:title]
		@post.body = params[:body]
		@post.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'Titre modifie', "body" = 'Contenu modifie', "updated_at" = '2011-11-16 08:03:02.459354' WHERE "posts"."id" = 1

	def delete
		@post = Post.find(params[:id])
		if check_author_post(@post.person_id, 'delete')
      @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]